// Напишите программу, которая выводит третью цифру 
// заданного числа или сообщает, что третьей цифры нет.

System.Console.WriteLine("Введите число");
int inputNumber = Convert.ToInt32(System.Console.ReadLine());



Console.WriteLine("Hello, World!");
