// Напишите программу, которая на вход принимает 
// число (N), а на выходе показывает все чётные

int n = Convert.ToInt32(Console.ReadLine());
int i = 0;

while (i<n-1)
{
   i+=2;
   System.Console.WriteLine(i);
}


